{
	"data": [{
		"type": "past-job",
		"id": 1,
		"attributes":
			{
				"company": "Epic",
				"position": "Software Development",
				"start": "January 2016",
				"end": "Present",
				"summary": "Develop and maintain functionality for sending and receiving letters and reports to and from healthcare providers and patients using M, Visual Basic, HTML and CSS. Developed and continue to develop many tools for testers using a variety of languages including JavaScript and Python.",
				"achievs": ["Testability trailblazer: incorporated automated testing into team's development process, and created a unit test library for team's functionality.","A bug in healthcare software can have life-and-death implications, and on many occasions I deployed critical fixes on extremely escalated timelines.","Developed a system for indexing available testing tools' documentation pages and a corresponding search engine (cf. Portfolio) using JavaScript and the MediaWiki API; indexes over two hundred tools, and this number grows constantly."]
			}
		},{
		"type": "past-job",
		"id": 2,
		"attributes":
			{
				"company": "Epic",
				"position": "Quality Assurance",
				"start": "May 2011",
				"end": "Present",
				"summary": "Worked alongside developers, technical services, implementation services, and end users to ensure that the software we released was of the best achievable quality. As the last pair of eyes on fixes and new functionality that could save lives, this job entailed taking on many roles, both technical and not: ultimately, I worked to push both our software and our development process to be as excellent as they could possibly be.",
				"achievs": ["Testing Automation Point Person for Epic's largest application: worked with test engineers to design and implement testing tools to improve the quality of our testing","User Experience Guru: worked often with end users to gather usability feedback, and worked with developers to translate this feedback into functionality","Strong technical tester: often sought first for troubleshooting questions, I was also part of a \"Bug Buster\" task force that worked on our team's riskiest development. In my testing, I found and submitted over 2200 bug reports."]
			}
		}]
}